# PythonGetSearchPath

## Description
Return the search path for python files.

```pascal
FUNCTION PythonGetSearchPath : DYNARRAY[] of CHAR;
```

```python

def vs.PythonGetSearchPath():
    return DYNARRAY[] of CHAR
```

## Returns
The result is a string of semicolon delimited paths. The path it similar to the 'Open' function path parameter.

## See Also
VS Functions:
PythonSetSearchPath| PythonExecute

## Version
Availability: from Vectorworks 2014
## Category
* Utility